//{{Kusakina O.A. Добавление элемента формы Контактное лицо
Функция  ДобавлениеКонтактногоЛицаВДокумент(Элементы) Экспорт
	//{{Kusakina O.A. Добавление элемента формы Контактное лицо
	ГруппаФормы = Элементы.Добавить("ГруппаДобавленная", Тип("ГруппаФормы"), Элементы.ГруппаКолонкиШапки);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы.Заголовок = " ";
	ДобавляемыеРеквизиты = Новый Массив;
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Neto_КонтактныеЛица");
	РеквизитФормы = Новый РеквизитФормы ("Neto_КонтактноеЛицо", ТипРеквизита, "","Контактное лицо");
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат ДобавляемыеРеквизиты;		
КонецФункции  

Процедура NetoПолеФормы(Элементы) Экспорт
	//{{Kusakina O.A. Добавление элемента формы Контактное лицо
	ПолеФормы = Элементы.Добавить("Neto_КонтактноеЛицо", Тип("ПолеФормы"));
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеФормы.ПутьКДанным = "Объект.Neto_КонтактноеЛицо";  
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Neto_КонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	 //ПолеФормы.УстановитьДействие("ПриИзменении", "КонтактноеЛицоПриИзменении");  
	//Kusakina O.A.}}
КонецПроцедуры 